bases/Wim_Du/projects/IMDEV-8663 ВечернииРДУ_ВыносРасчетаСЧА_РСА_ВКонец/Расширения/IM86632/Documents/ПланРегламентныхОперацийДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПланРегламентныхОперацийДУ</Name>
		</Properties>
		<ChildObjects>
		
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорДУ</Name>
					<Type><v8:Type>cfg:CatalogRef.ДоговорДУ</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаОперацийПользователя</Name>
					<Type><v8:Type>cfg:CatalogRef.ВидыОперацийЗакрытияПериода</v8:Type></Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланВечернихОпераций</Name>					<Type>
						<v8:Type>cfg:DocumentRef.ПланРегламентныхОперацийДУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

bases/Wim_Du/projects/IMDEV-8663 ВечернииРДУ_ВыносРасчетаСЧА_РСА_ВКонец/Расширения/IM86632/Documents/ПланРегламентныхОперацийДУ/Ext/ObjectModule.bsl
#Область IMDEV_8663_2_СвязьГрупп

// Описание: При ручной записи плана группы 3 заполняет ПланВечернихОпераций.
// Если реквизит уже заполнен (массовый контур), запрос не выполняется.
//
// Параметры:
//  Отказ - Булево - признак отказа записи
//  РежимЗаписи - РежимЗаписиДокумента - режим записи
//  РежимПроведения - РежимПроведенияДокумента - режим проведения
//
&После("ПередЗаписью")
Процедура IM86632_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

    Если ОбменДанными.Загрузка Или Отказ Или ПометкаУдаления Тогда
        Возврат;
    КонецЕсли;
    Если ЗначениеЗаполнено(ПланВечернихОпераций) Тогда
        Возврат;
    КонецЕсли;

    ГруппаСЧА = Справочники.ВидыОперацийЗакрытияПериода.НайтиПоКоду(
        Справочники.РегламентныеПериоды.КодГруппыРасчетаСЧА_РСА());
    Если ГруппаСЧА.Пустая() Или ГруппаОперацийПользователя <> ГруппаСЧА Тогда
        Возврат;
    КонецЕсли;

    ПланВечернихОпераций = Справочники.РегламентныеПериоды.НайтиПроведенныйВечернийПлан(
        Дата, ДоговорДУ);
    Если Не ЗначениеЗаполнено(ПланВечернихОпераций) Тогда
        ТекстСообщения = НСтр("ru='Нет проведенного плана вечерних операций за эту дату по договору ДУ.
            |Документ расчета СЧА/РСА не записан.'");
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
